# Item Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveByPointsArray..::..Item Property
CurveByPointsArray Class See Also
---
Gets or sets a curve at a specified index within the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual CurveByPoints this[
	int index
] { get; set; }
```

Visual Basic
---
```text
Public Overridable Property Item ( _
	index As Integer _
) As CurveByPoints
	Get
	Set
```

Visual C++
---
```text
public:
virtual property CurveByPoints^ Item[int index] {
	CurveByPoints^ get (int index);
	void set (int index, CurveByPoints^ value);
}
```

# ### Parameters
index
    Type: System..::..Int32The index of the curve to be set or retrieved.
# ### Return Value
Returns the curve at the specified index.
# See Also
CurveByPointsArray Class
Autodesk.Revit.DB Namespace